src/DataProcessors/ВКМ_СозданиеАктов/ВКМ_СозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_СозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокДоговоров</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/DataProcessors/ВКМ_СозданиеАктов/ManagerModule.bsl
Процедура ВыполнитьСозданиеРеализацийВФоне(Параметры) Экспорт
	
	НачалоМесяца = НачалоМесяца(Параметры.Период);
	КонецМесяца  = КонецМесяца(Параметры.Период);
	
	ТаблицаРезультатов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Реализация.ДоговорКонтрагента КАК Договор,
		|	МАКСИМУМ(Реализация.Ссылка) КАК Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК Реализация
		|ГДЕ
		|	Реализация.ДоговорКонтрагента В(&Договоры)
		|	И Реализация.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
		|	И НЕ Реализация.ПометкаУдаления
		|СГРУППИРОВАТЬ ПО
		|	Реализация.ДоговорКонтрагента";
	
	Запрос.УстановитьПараметр("Договоры",      Параметры.Договоры);
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца);
	Запрос.УстановитьПараметр("КонецМесяца",  КонецМесяца);
	
	ТаблицаСуществующих = Запрос.Выполнить().Выгрузить();
	ТаблицаСуществующих.Индексировать("Договор");
	
	Для Каждого ТекущийДоговор Из Параметры.Договоры Цикл
		
		СтрокаСуществующего = ТаблицаСуществующих.Найти(ТекущийДоговор, "Договор");
		
		Если СтрокаСуществующего <> Неопределено Тогда
			ТаблицаРезультатов.Добавить(Новый Структура("Договор, Реализация", ТекущийДоговор, СтрокаСуществующего.Ссылка));
			Продолжить;
		КонецЕсли;
		
		НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		НовыйДокумент.Дата                = КонецМесяца;
		НовыйДокумент.Организация         = ТекущийДоговор.Организация;
		НовыйДокумент.Контрагент          = ТекущийДоговор.Владелец;
		НовыйДокумент.ДоговорКонтрагента  = ТекущийДоговор;
		
		НовыйДокумент.Заполнить(ТекущийДоговор);
		НовыйДокумент.ВыполнитьАвтозаполнение();
		
		Если НовыйДокумент.ПроверитьЗаполнение() Тогда
			Попытка
				НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
				ТаблицаРезультатов.Добавить(Новый Структура("Договор, Реализация", ТекущийДоговор, НовыйДокумент.Ссылка));
			Исключение
				ТаблицаРезультатов.Добавить(Новый Структура("Договор, Реализация", ТекущийДоговор, Неопределено));
			КонецПопытки;
		Иначе
			ТаблицаРезультатов.Добавить(Новый Структура("Договор, Реализация", ТекущийДоговор, Неопределено));
		КонецЕсли;
		
	КонецЦикла;
	
	АдресРезультата = ПоместитьВоВременноеХранилище(ТаблицаРезультатов);
КонецПроцедуры  


Функция ВыполнитьСозданиеРеализацийНаСервере(Параметры) Экспорт
	
	НачалоМесяца = НачалоМесяца(Параметры.Период);
    КонецМесяца  = КонецМесяца(Параметры.Период);
    ТекущийПользователь = Пользователи.ТекущийПользователь();
    
    ТаблицаРезультатов = Новый Массив;
    
    ЗапросСуществующих = Новый Запрос;
    ЗапросСуществующих.Текст = 
        "ВЫБРАТЬ
        |   Реализация.Договор КАК Договор,
        |   Реализация.Ссылка КАК Ссылка
        |ИЗ
        |   Документ.РеализацияТоваровУслуг КАК Реализация
        |ГДЕ
        |   Реализация.Договор В (&СписокДоговоров)
        |   И Реализация.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
        |   И НЕ Реализация.ПометкаУдаления";
    
    ЗапросСуществующих.УстановитьПараметр("СписокДоговоров", Параметры.Договоры);
    ЗапросСуществующих.УстановитьПараметр("НачалоМесяца", НачалоМесяца);
    ЗапросСуществующих.УстановитьПараметр("КонецМесяца", КонецМесяца);
    
    Выборка = ЗапросСуществующих.Выполнить().Выбрать();
    
    СоответствиеСуществующих = Новый Соответствие;
    Пока Выборка.Следующий() Цикл
        СоответствиеСуществующих.Вставить(Выборка.Договор, Выборка.Ссылка);
    КонецЦикла;

    Для Каждого ТекущийДоговор Из Параметры.Договоры Цикл
        
        СуществующаяРеализация = СоответствиеСуществующих.Получить(ТекущийДоговор);
        
        Если СуществующаяРеализация <> Неопределено Тогда
            ТаблицаРезультатов.Добавить(Новый Структура("Договор, Реализация", ТекущийДоговор, СуществующаяРеализация));
            Продолжить;
        КонецЕсли;
        
        НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
        НовыйДокумент.Дата                = КонецДня(КонецМесяца);
        НовыйДокумент.Организация         = ТекущийДоговор.Организация;
        НовыйДокумент.Контрагент          = ТекущийДоговор.Владелец;
        НовыйДокумент.Договор             = ТекущийДоговор;
        НовыйДокумент.Ответственный       = ТекущийПользователь;
        НовыйДокумент.ВыполнитьАвтозаполнение();
        
        Если НовыйДокумент.ПроверитьЗаполнение() Тогда
            Попытка
                НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
                ТаблицаРезультатов.Добавить(Новый Структура("Договор, Реализация", ТекущийДоговор, НовыйДокумент.Ссылка));
            Исключение
                ТаблицаРезультатов.Добавить(Новый Структура("Договор, Реализация", ТекущийДоговор, Неопределено));
            КонецПопытки;
        Иначе
            ТаблицаРезультатов.Добавить(Новый Структура("Договор, Реализация", ТекущийДоговор, Неопределено));
        КонецЕсли;
        
    КонецЦикла;
    
    Возврат ТаблицаРезультатов;
	
	
КонецФункции
